Revit 2027 API
SymbolTypeId.DollarPerFtSup2 Property
 Symbol $/ft², indicating unit Cost per square foot.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DollarPerFtSup2 { get; }
Public Shared ReadOnly Property DollarPerFtSup2 As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DollarPerFtSup2 {
	ForgeTypeId^ get ();
}
static member DollarPerFtSup2 : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SymbolTypeId Class
Autodesk.Revit.DB Namespace